MCUdude/TinyCore/avr/boards.txt
# Clock frequencies
x61.menu.clock.8MHz_internal=8 MHz internal osc.
x61.menu.clock.8MHz_internal.bootloader.clock=8MHz
x61.menu.clock.8MHz_internal.bootloader.osc=i
x61.menu.clock.8MHz_internal.bootloader.low_fuses=0xe2
x61.menu.clock.8MHz_internal.bootloader.baudrate=38400
x61.menu.clock.8MHz_internal.build.clocksource=0
x61.menu.clock.8MHz_internal.build.f_cpu=8000000L

x61.menu.clock.16MHz_internal_PLL=16 MHz internal PLL osc.
x61.menu.clock.16MHz_internal_PLL.bootloader.clock=16MHz
x61.menu.clock.16MHz_internal_PLL.bootloader.osc=i
x61.menu.clock.16MHz_internal_PLL.bootloader.low_fuses=0xf1
x61.menu.clock.16MHz_internal_PLL.bootloader.baudrate=57600
x61.menu.clock.16MHz_internal_PLL.build.clocksource=6
x61.menu.clock.16MHz_internal_PLL.build.f_cpu=16000000L

x61.menu.clock.4MHz_internal=4 MHz internal osc.
x61.menu.clock.4MHz_internal.bootloader.clock=4MHz
x61.menu.clock.4MHz_internal.bootloader.osc=i
x61.menu.clock.4MHz_internal.bootloader.low_fuses=0x62
x61.menu.clock.4MHz_internal.bootloader.baudrate=9600
x61.menu.clock.4MHz_internal.build.clocksource=0
x61.menu.clock.4MHz_internal.build.f_cpu=4000000L

x61.menu.clock.1MHz_internal=1 MHz internal osc.
x61.menu.clock.1MHz_internal.bootloader.clock=1MHz
x61.menu.clock.1MHz_internal.bootloader.osc=i
x61.menu.clock.1MHz_internal.bootloader.low_fuses=0x62
x61.menu.clock.1MHz_internal.bootloader.baudrate=9600
x61.menu.clock.1MHz_internal.build.clocksource=0
x61.menu.clock.1MHz_internal.build.f_cpu=1000000L

x61.menu.clock.128kHz_internal=128 kHz internal osc.
x61.menu.clock.128kHz_internal.bootloader.clock=128kHz
x61.menu.clock.128kHz_internal.bootloader.osc=i
x61.menu.clock.128kHz_internal.bootloader.low_fuses=0xe3
x61.menu.clock.128kHz_internal.bootloader.baudrate=1200
x61.menu.clock.128kHz_internal.build.clocksource=3
x61.menu.clock.128kHz_internal.build.f_cpu=128000L

x61.menu.clock.20MHz_external=20 MHz external osc.
x61.menu.clock.20MHz_external.bootloader.clock=20MHz
x61.menu.clock.20MHz_external.bootloader.osc=x
x61.menu.clock.20MHz_external.bootloader.low_fuses=0xff
x61.menu.clock.20MHz_external.bootloader.baudrate=115200
x61.menu.clock.20MHz_external.build.clocksource=1
x61.menu.clock.20MHz_external.build.f_cpu=20000000L

x61.menu.clock.18_432MHz_external=18.432 MHz external osc.
x61.menu.clock.18_432MHz_external.bootloader.clock=18.432MHz
x61.menu.clock.18_432MHz_external.bootloader.osc=x
x61.menu.clock.18_432MHz_external.bootloader.low_fuses=0xff
x61.menu.clock.18_432MHz_external.bootloader.baudrate=115200
x61.menu.clock.18_432MHz_external.build.clocksource=1
x61.menu.clock.18_432MHz_external.build.f_cpu=18432000L

x61.menu.clock.16MHz_external=16 MHz external osc.
x61.menu.clock.16MHz_external.bootloader.clock=16MHz
x61.menu.clock.16MHz_external.bootloader.osc=x
x61.menu.clock.16MHz_external.bootloader.low_fuses=0xff
x61.menu.clock.16MHz_external.bootloader.baudrate=115200
x61.menu.clock.16MHz_external.build.clocksource=1
x61.menu.clock.16MHz_external.build.f_cpu=16000000L

x61.menu.clock.14_7456MHz_external=14.7456 MHz external osc.
x61.menu.clock.14_7456MHz_external.bootloader.clock=14.7456MHz
x61.menu.clock.14_7456MHz_external.bootloader.osc=x
x61.menu.clock.14_7456MHz_external.bootloader.low_fuses=0xff
x61.menu.clock.14_7456MHz_external.bootloader.baudrate=115200
x61.menu.clock.14_7456MHz_external.build.clocksource=1
x61.menu.clock.14_7456MHz_external.build.f_cpu=14745600L

x61.menu.clock.12MHz_external=12 MHz external osc.
x61.menu.clock.12MHz_external.bootloader.clock=12MHz
x61.menu.clock.12MHz_external.bootloader.osc=x
x61.menu.clock.12MHz_external.bootloader.low_fuses=0xff
x61.menu.clock.12MHz_external.bootloader.baudrate=115200
x61.menu.clock.12MHz_external.build.clocksource=1
x61.menu.clock.12MHz_external.build.f_cpu=12000000L

x61.menu.clock.11_0592MHz_external=11.7456 MHz external osc.
x61.menu.clock.11_0592MHz_external.bootloader.clock=11.0592MHz
x61.menu.clock.11_0592MHz_external.bootloader.osc=x
x61.menu.clock.11_0592MHz_external.bootloader.low_fuses=0xff
x61.menu.clock.11_0592MHz_external.bootloader.baudrate=115200
x61.menu.clock.11_0592MHz_external.build.clocksource=1
x61.menu.clock.11_0592MHz_external.build.f_cpu=11059200L

x61.menu.clock.9_216MHz_external=9.216 MHz external osc.
x61.menu.clock.9_216MHz_external.bootloader.clock=9.216MHz
x61.menu.clock.9_216MHz_external.bootloader.osc=x
x61.menu.clock.9_216MHz_external.bootloader.low_fuses=0xff
x61.menu.clock.9_216MHz_external.bootloader.baudrate=115200
x61.menu.clock.9_216MHz_external.build.clocksource=1
x61.menu.clock.9_216MHz_external.build.f_cpu=9216000L

x61.menu.clock.8MHz_external=8 MHz external osc.
x61.menu.clock.8MHz_external.bootloader.clock=8MHz
x61.menu.clock.8MHz_external.bootloader.osc=x
x61.menu.clock.8MHz_external.bootloader.low_fuses=0xff
x61.menu.clock.8MHz_external.bootloader.baudrate=38400
x61.menu.clock.8MHz_external.build.clocksource=1
x61.menu.clock.8MHz_external.build.f_cpu=8000000L

x61.menu.clock.7_372MHz_external=7.372 MHz external osc.
x61.menu.clock.7_372MHz_external.bootloader.clock=7.372MHz
x61.menu.clock.7_372MHz_external.bootloader.osc=x
x61.menu.clock.7_372MHz_external.bootloader.low_fuses=0xfd
x61.menu.clock.7_372MHz_external.bootloader.baudrate=115200
x61.menu.clock.7_372MHz_external.build.clocksource=1
x61.menu.clock.7_372MHz_external.build.f_cpu=7372000L

x61.menu.clock.6MHz_external=6 MHz external osc.
x61.menu.clock.6MHz_external.bootloader.clock=6MHz
x61.menu.clock.6MHz_external.bootloader.osc=x
x61.menu.clock.6MHz_external.bootloader.low_fuses=0xfd
x61.menu.clock.6MHz_external.bootloader.baudrate=57600
x61.menu.clock.6MHz_external.build.clocksource=1
x61.menu.clock.6MHz_external.build.f_cpu=6000000L

x61.menu.clock.4MHz_external=4 MHz external osc.
x61.menu.clock.4MHz_external.bootloader.clock=4MHz
x61.menu.clock.4MHz_external.bootloader.osc=x
x61.menu.clock.4MHz_external.bootloader.low_fuses=0xfd
x61.menu.clock.4MHz_external.bootloader.baudrate=57600
x61.menu.clock.4MHz_external.build.clocksource=1
x61.menu.clock.4MHz_external.build.f_cpu=4000000L

